app/Http/Controllers/TopicsController.php

select * from `categories`
---
    public function create(Topic $topic)
    {
        $categories = Category::all();

insert into `topics` (`title`, `category_id`, `body`, `user_id`, `excerpt`, `updated_at`, `created_at`) values ('安徽中医药高等专科学校2018年三公经费预算情况', '3', '<p><img alt=\"7.png\" src=\"http://lbbs.test/uploads/images/topics/201812/17/1_1545038311_4p0MLOHspB.png\" width=\"100\" height=\"73.75565610859728\">测试呀<img alt=\"102.png\" src=\"http://lbbs.test/uploads/images/topics/201812/17/1_1545038348_JSeWsDZmWj.png\" width=\"300\" height=\"222.44897959183675\"><br></p>', 1, '测试呀', '2018-12-17 17:19:26', '2018-12-17 17:19:26')
---
    public function store(TopicRequest $request, Topic $topic)
    {
        $topic->fill($request->all());
        $topic->user_id = Auth::id();
        $topic->save();

select * from `categories`
---
    public function edit(Topic $topic)
    {
        $this->authorize('update', $topic);
        $categories=Category::all();

update `topics` set `body` = '<p>正常正常的</p>', `category_id` = '1', `excerpt` = '正常正常的', `updated_at` = '2018-12-18 14:01:31' where `id` = 108
---
    public function update(TopicRequest $request, Topic $topic)
    {
        $this->authorize('update', $topic);
        $topic->update($request->all());